Replace the diagram
